app/views/games/show.html.erb


      <% if @game.comments.any? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."game_id" = $1 LIMIT 1  [["game_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."game_id" = $1  [["game_id", 1]]