app/controllers/games_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "games".* FROM "games"
---
  def index
    if params[:user_id]
      @games = User.find(params[:user_id]).games
    else
      @games = Game.all