app/controllers/users_controller.rb

  def dashboard
    enforce_login(params[:id], "/")
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]

  def show
    @games = Game.all
---
SELECT "games".* FROM "games"